In [1]:
import pandas as pd

In [3]:
a = [1,2,3,4,5,6,7,8,9,10]
b = [11,22,33,44,55,66,77,88,99,100]


c = [1,1,1,1,1]
d = ['yo','hi','welcome','to','Goa']

In [5]:
df = pd.DataFrame({'id':a, 'marks':b})
df2 = pd.DataFrame({'id':c, 'euu':d})

In [6]:
df

   id  marks
0   1     11
1   2     22
2   3     33
3   4     44
4   5     55
5   6     66
6   7     77
7   8     88
8   9     99
9  10    100

In [7]:
df2

   id      euu
0   1       yo
1   1       hi
2   1  welcome
3   1       to
4   1      Goa

In [10]:
pd.merge(df,df2,left_on='id',right_on='id',how='inner')

   id  marks      euu
0   1     11       yo
1   1     11       hi
2   1     11  welcome
3   1     11       to
4   1     11      Goa

In [11]:
pd.merge(df,df2,left_on='id',right_on='id',how='left')

    id  marks      euu
0    1     11       yo
1    1     11       hi
2    1     11  welcome
3    1     11       to
4    1     11      Goa
5    2     22      NaN
6    3     33      NaN
7    4     44      NaN
8    5     55      NaN
9    6     66      NaN
10   7     77      NaN
11   8     88      NaN
12   9     99      NaN
13  10    100      NaN

In [12]:
a1 = [1,2,3,4,5]
b1 = ['a','a','a','b','c']


c1 = [1,2,2,1,1]
d1 = ['c','c','c','d','d']

In [17]:
df3 = pd.DataFrame({'C':a1, 'D':b1})
df4 = pd.DataFrame({'C':c1, 'B':d1})

In [19]:
df3,df4

(   C  D
 0  1  a
 1  2  a
 2  3  a
 3  4  b
 4  5  c,
    C  B
 0  1  c
 1  2  c
 2  2  c
 3  1  d
 4  1  d)

In [18]:
pd.merge(df3,df4,left_on='C',right_on='C',how='left')

   C  D    B
0  1  a    c
1  1  a    d
2  1  a    d
3  2  a    c
4  2  a    c
5  3  a  NaN
6  4  b  NaN
7  5  c  NaN

In [24]:
yoo = df3.groupby(['C'])
yoo

In [25]:
yoo.first()

   D
C
1  a
2  a
3  a
4  b
5  c

In [26]:
for y in yoo:
    print(y)

(1,    C  D
0  1  a)
(2,    C  D
1  2  a)
(3,    C  D
2  3  a)
(4,    C  D
3  4  b)
(5,    C  D
4  5  c)

In [27]:
yoo.get_group(1)

   C  D
0  1  a